package com.galukhin.learningandroid.___resources;
/* у картинок нет разрешения в конце, поэтому не должно быть в 1 папке 2 файлов с 1 названием*/

/* картинки можно сжимать в WebP формат из правого меню*/



/* контрейнер - способ организовать множественные виджеты в какую-то структуру*/

/* антипаттерн абсолютного позиционирования - если я изменю размер окна/экрана это никак не отразится
 * на размещенных абсолютным способом элементах - только пустое место добавится. а девайс может быть
 * любого размера*/


/* R.java генерируется тулзой aapt из лейаутов, она автоматически запускается Andr Studio*/

/* почти все, что можно сделать через хмл лейаут можно сделать и через код. Одни из важных причин -
* графическое изображение и легкость изменения кода
* XML forms a nice middle ground between
something that is easy for tool-writers to use and easy for programmers to work with
by hand as needed.
*
* */


/* color resources являются value ресурсами
* - res/values/colors.xml*/


/* menu resources*/
public class Main {
}
